RIP Routing Information Protocol
- Small Business
- Distance Vector routing protocol
- Determines best path based on hop count (limit to 15 hops)
- Allows for load balancing across equal paths (4 is default)
- Easy to configure, no scalability, not power demanding
- Sends update by default every 30s
- Default RIP multicast address 224.0.0.9
- RIP uses UDP port 520

==Enable RIP v2==
R1#conf t
R1(config)#router rip
R1(config-router)#version 2
==Setup RIP v2 Networks==
R1(config-router)#network 1.0.0.0
R1(config-router)#network 10.0.0.0 
**Any interface on the router within the network range will be assigned RIP automatically through classful boundaries
==Disable auto-summary - for network IP Address conflicts==
ex. R1 loopback is 1.1.1.1/32 (network 1.0.0.0) and R3 loopback is 1.1.1.2/32 (network 1.0.0.0) and R2 is between R1 and R3.
R1(config-router)#no auto-summary 
==Disable a router's interface f0/1 from advertising routes, but still able to receive routes==
R1(config-router)#passive-interface f0/1
==Advertise a router as the default, gateway of last resort==
*R1<->R2<->R3(f0/1)<->Internet
*Now, R3 is automatically set for R1 and R2 as the gateway of last resort
R3(config-router)#default-information originate (advertise default route to all routers)
==Enable DHCP==
R3(config-router)#int f0/1
R3(config-if)#ip address dhcp
==Enable DNS==
R3(config-if)#exit
R3(config)#ip domain-lookup (enable DNS)
R3(config)#ip name-server 8.8.8.8 (setting DNS)
==Change RIP timers==
R3(config)#router rip
R3(config-router)# timers ______
**General rule of thumb, don't change timers. If timers are changed, make them all consistent
==Misc==
R3#debug ip rip
R3#sh ip route
R3#sh ip rip database
R3#sh ip protocols
R3#sh run | section rip
__________________________________________________________

===VLAN Simulations - Section303===
Enable RIP on the routers in the diagram
Advertise the FastEthernet (192.168.1.1) interface first and then the Serial interface (10.1.1.1)
Set RIP to version 2
Ensure that Router1 advertises routes correctly
...
Advertise the FastEthernet (192.168.2.1) interface first and then the Serial interface (10.1.1.1)
Advertise the FastEthernet (192.168.3.1) interface first and then the Serial interface (10.1.1.1)

Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# router rip 
Router1(config-if)# network 192.168.1.0
Router1(config-if)# network 10.0.0.0
Router1(config-if)# version 2
Router1(config-if)# int s0/1
Router1(config-if)# no ip split-horizon 

Router2> en
Router2# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router2(config)# router rip
Router2(config-if)# network 192.168.2.0
Router2(config-if)# network 10.0.0.0
Router2(config-if)# version 2
...
Router3(config)# router rip
Router3(config-if)# network 192.168.3.0
Router3(config-if)# network 10.0.0.0
Router3(config-if)# version 2


===VLAN Simulations - XX ===
> Display the routing protocols enabled on the router
Router1> en
Router1# show ip protocols

> Display the routing table
Router1> en
Router1# show ip route

> Display RIP updates in real time
Router1> en
Router1# debug ip rip


===VLAN Simulations - 308 ===
Enable RIP
An IP address of 172.16.1.24 /16 is configured on Ethernet 0. Advertise this network in RIP.
Set the RIP version to 2.

Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# router rip
Router1(config-router)# network 172.16.0.0
Router1(config-router)# version 2


===VLAN Simulations - 308 ===
Enable RIP on Router1 only. Router2 has already been configured.
An IP address of 172.16.1.1/24 is configured on Ethernet 0/0. Advertise this network in RIP.
An IP address of 10.10.10.10/24 is configured on Serial 1/0. Advertise this RIP

Router1> en
Router1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)# router rip 
Router1(config-router)# network 172.16.0.0
Router1(config-router)# network 10.0.0.0
_____________________________________________

==InterVLAN routing==
PC1 <-> Switch <-> PC2
	^R1

Configure PC1 with 10.1.2.1 /24 in VLAN2
Configure PC2 with 10.1.3.1 /24 in VLAN3
Configure R1 with 10.1.1.254 /24 in VLAN1, 10.1.2.254 /24 in VLAN2, 10.1.3.254 /24 in VLAN3
Make sure PC1 can ping PC2 using R1 as "router on a stick"

PC1>ip 10.1.2.1 255.255.255.0 10.1.2.254

PC2>ip 10.1.3.1 255.255.255.0 10.1.3.254

R1>en
R1#conf t
R1(config)#int f0/0.1
R1(config-subif)#encapsulation dot1q 1 native (need to configure this VLAN first)
R1(config-subif)#ip address 10.1.1.254 255.255.255.0
R1(config-subif)#int f0/0.2
R1(config-subif)#encapulation dot1q 2
R1(config-subif)#ip address 10.1.2.254 255.255.255.0
R1(config-subif)#int f0/0.3
R1(config-subif)#encapulation dot1q 3
R1(config-subif)#ip address 10.1.3.254 255.255.255.0

__________________________________________________________

===VLAN Simulations - Section313===
Configure the SVI for VLAN 10 with IP address 10.1.1.1 255.255.255.0
Configure the SVI for VLAN 20 with IP address 10.2.2.1 255.255.255.0
Enable ip routing on the switch

Switch1> en
Switch1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch1(config)# int vlan 10
Switch1(config-if)# ip address 10.1.1.1 255.255.255.0
Switch1(config-if)# int vlan 20
Switch1(config-if)# ip address 10.2.2.1 255.255.255.0
Switch1(config-if)# ip routing

__________________________________________________________

===VLAN Simulations - Section314===
**Note: Routed Port = Access Port
Configure Fa0/10 on Switch1 as a routed port
Use the ip address 10.1.1.1 255.255.255.0 on interface Fa0/10

Switch1> en
Switch1# conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch1(config)# int f0/10
Switch1(config-if)# no switchport
Switch1(config-if)# ip address 10.1.1.1 255.255.255.0

__________________________________________________________

Classful networks A,B,C 
- Not scalable
- RIPv1, IGRP

CIDR Classless Interdomain Routing
- Scalable
- Based on VLSM Variable Length Subnet Mask 
- **RIPv2, **EIGRP, OSPF
**Acts as Classful by default, you need to use "no auto-summary" command

Summarization
- Instead of sending all of the advertisements of IPs on a network to another network, we can send a single advertisement
- Hides topology, if a single router goes down inside a network, the other network won't know about it
----
ex. 10.1.10/24 - 10.1.200.0/24 can be summarized into network 10.1.0.0 /16. Full connectively can remain estbalished with 10.1.0.0 /16
----
ex. 172.16.32.0/24 - 172.16.63.0/24 can be viewed as follows...
172.16.32.0 172.16. 0010 0000 . 0
172.16.63.0 172.16. 0011 1111 . 0 
So... we have 0010, or 32. Therefore, the summary address will be 172.16.32.0 /19
----
ex. 172.16.64.0/24 - 172.16.127.0/24... NOTICE....
** It's always just the first bit, therefore 172.16.64.0  /18

Classful Routing - assumes everyone is using the same network mask, summary routes are automatic
Classless Routing - includes networkmask, summary routes can be manually configured

Auto Summarization occurs when:
- Cross classful boundaries class A/B/C
- Cross major network boundaries 10.0.0.0 to 11/12.0.0.0

How will a router choose its route?
1) Choose longest match -> Most specific. /27 is more specific than /16
2) If IP address and mask is all the same, then it will be decided by lowest administrative distance (EIGRP > OSPF > RIPv2)

==Enable OSPF==
R1#config t
R1(config)#router ospf 1
R1(config-router)#network 0.0.0.0 255.255.255.0 area 0
==Enable EIGRP==
R1(config)#router eigrp 1
R1(config-router)#network 0.0.0.0
==Show commands==
R1#show ip route
R1#show ip bgp summary
R1#show ip bgp neigh
==No shutdown bgp neighbour==
R1(config)#router bgp 1
R1(config-router)#no neighbor 10.1.1.2 shutdown

Administrative distance
eBGP = 20
EIGRP = 90
OSPF = 110
RIP = 120
iBGP = 200

"Rib Failure" 
- from 'show ip bgp' indicates a route learned from a neighbor has lower administrative distance (static or other IGP Internet Gateway Protocol) in the routing table, therefore BGP route has failed to install into IP routing table (RIB Routing Information Base)

First Hop Redundacy Protocols
**Think of your PC having 2 default gateways, but 2 default gateways is set on the switch/router rather than the PC itself
- Provides hop redundacy - incase one network gateway goes down, there is a second gateway available through the use of a standby virtual router
- Highest priority (100 is default, therefore we will set 200 as the highest priority) will be the 'active forwarder/router' for the VLAN
1) HSRP Hop Standby Routing Protocol
- Cisco Proprietary
2) VRRP Virtual Router Redundacy Protocol
- Industry standard

==Set HSRP Active==
We want to set Switch1 as the active forwarder (priority of 200, default = 100) for VLAN 10 (10.1.10.254/24) and Switch2
Switch1#conf t
Switch1(config)#int vlan 10
Switch1(config-if)#standby groupNumber (random) ip (ipAddressOfVlan)
Switch1(config-if)#standby 1 ip 10.1.10.254
Switch1(config-if)#standby 1 priority 200 
Switch1(config-if)#standby 1 preempt (makes sure Switch1 is the active forwarder when it is up. If it goes down and back up, it will force itself to be the active forwarder)
==Confirm this==
Switch1#show standby
**Because the router is virtual, it also gets a virtual HSRP MAC Address 0000.0c07.ac(hexadecimalOfGroup#)
**Virtual routers can use the same MAC address for mutliple VLANs because its Layer 2
Switch1#show running interface vlan 10
==Set HSRP Secondary==
Switch2#conf t
Switch2(config)#int vlan 10
Switch2(config-if)#standby groupNumber (random) ip (ipAddressOfVlan)
Switch2(config-if)#standby 1 ip 10.1.10.254
*Optional*Switch2(config-if)#standby 1 priority 100
==Change standby timers for quicker switchover==
Switch2(config-if)#standby 1 timers 1 3

NTP Network Time Protocol
- UDP port 123
- Unicast, multicast, broadcast

==Setting NTP Client time/date [Manual]==
[Privledge mode] R1#clock set 23:04:00 16 August 2016  
[GlobalExe mode] R1(config)#clock timezone GMT 0
[GlobalExe mode] R1(config)#clock summer-time randomName recurring last Sun March 1:00 last Sun 1:00
==Setting NTP Master time/date [Manual]==
**Loopback is good for this because Loopback doesn't go down
R2#conf t
R2(config)#ntp master 10 
R2(config)#ntp source loopback 0 (IP 3.3.3.3)
**# is 1-15. Lower the #, closer to atomic source
==Confirm this==
R2#sh ntp associations
==Setting time/date [Auto with NTP Master]==
R1#conf t
R1(config)# ntp server 3.3.3.3

SPAN Switch Port Analyzer
- Mirror / Monitor a port or VLAN by either sending that port's traffic to another port, or sending VLAN1's traffic to another port - make copies of Ethernet Frames

Remote SPAN 
- Copy Ethernet Frames from a local switch to a remote switch

==Setup SPAN (monitor)==
> Capture data that goes through Switch1 vlan 1, then send it to port f1/0/5
S1#conf t
S1(config)#monitor session [randomNumberIsSwitchDependent**]
S1(config)#monitor session 1 source vlan 1 both [both = sent and receive]
S1(config)#monitor session 1 destination interface fastEthernet 1/0/5
> Setup session 2 in a similar way, and change destination to session 2
S1(config)#monitor session 2 source interface f1/0/3
S1(config)#no monitor session 1 destination interface fastEthernet 1/0/5
S1(config)#monitor session 2 destination interface fastEthernet 1/0/5
**Remember, a SPAN Destination port can only be used on a SINGLE SESSION
==Confirm==
S1#do sh run | i monitor
S1#show monitor
==Setup SPAN on 2 interfaces==
> Capture RECEIVE ONLY On both f1/0/3 and f1/0/1 
S1#conf t
S1(config)#monitor session 1 source interface fastEthernet 1/0/3, fastEthernet 1/0/1 rx
==Disable SPAN (monitor)==
S1(config)#no monitor session 1

==Allow SPAN traffic==
**By default, SPAN ports' MAC Address is removed, therefore traffic is not accepted
S1(config)#monitor session 1 destination interface fastEthernet 1/0/5 ingress untagged vlan 1

SPAN overview:
- 1 SPAN destination port = 1 SPAN session at a time
- SPAN destination port =/= SPAN source port
- Multiple SPAN source ports are allowed
- 1 SPAN session cannot mix both interfaces and VLAN sources
- SPAN destination port is no longer treated as an ethernet port - MAC Address not learned by switch



